In [1]:
import pandas as pd
import numpy as np
# Read csv file
df = pd.read_csv('/nba.csv')

In [2]:
#print first 5 rows
print(df.head())

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

In [3]:
#print shape
print(df.shape)

(458, 9)

In [4]:
#print statistical summary
print(df.describe())

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [5]:
#print num of nulls
print(df.info())   ###we find (college) contain 84 null values,(salary) contain 11 null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB
None

In [6]:
#find duplicated
df.duplicated() ###we find that there are no duplicate

0      False
1      False
2      False
3      False
4      False
       ...
453    False
454    False
455    False
456    False
457    False
Length: 458, dtype: bool

In [7]:
#cleaning
df['College'].fillna('Unknown', inplace=True)
df['Salary'].fillna(df['Salary'].median(), inplace=True)

In [8]:
#convert height to cm
df['foot'] = pd.to_numeric(df['Height'].str.split('-').str[0], errors='coerce')
df['inches'] = pd.to_numeric(df['Height'].str.split('-').str[1], errors='coerce')
df['CM_Height'] = df['foot'] * 30 + df['inches'] * 2.5
df = df.drop(['foot', 'inches'], axis=1)

In [9]:
#check if any nulls after convert
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       457 non-null    object
 1   Team       457 non-null    object
 2   Number     457 non-null    float64
 3   Position   457 non-null    object
 4   Age        457 non-null    float64
 5   Height     457 non-null    object
 6   Weight     457 non-null    float64
 7   College    458 non-null    object
 8   Salary     458 non-null    float64
 9   CM_Height  457 non-null    float64
dtypes: float64(5), object(5)
memory usage: 35.9+ KB
None

In [10]:
print(df.head())

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary  CM_Height
0              Texas  7730337.0      185.0
1          Marquette  6796117.0      195.0
2  Boston University  2839073.0      192.5
3      Georgia State  1148640.0      192.5
4            Unknown  5000000.0      205.0

In [11]:
#player with highest salary
highest = df.loc[df['Salary'].idxmax(), 'Name']
print(f" player with the highest salary is: {highest}")

 player with the highest salary is: Kobe Bryant

In [12]:
#avg salary
print(f"average salary is: {df['Salary'].mean()}")

average salary is: 4790187.744541485

In [13]:
#avg salary each team
team_avg_salary = df.groupby('Team')['Salary'].mean().sort_values(ascending=False)
print("average salary for each team ")
print(team_avg_salary)

average salary for each team
Team
Cleveland Cavaliers       7.321851e+06
Los Angeles Clippers      6.323643e+06
Oklahoma City Thunder     6.251020e+06
Golden State Warriors     5.924600e+06
Miami Heat                5.879588e+06
Chicago Bulls             5.785559e+06
San Antonio Spurs         5.629516e+06
Charlotte Hornets         5.222728e+06
Washington Wizards        5.088576e+06
Houston Rockets           5.018868e+06
Memphis Grizzlies         4.883732e+06
Atlanta Hawks             4.860197e+06
Los Angeles Lakers        4.784695e+06
Sacramento Kings          4.778911e+06
Dallas Mavericks          4.746582e+06
Toronto Raptors           4.741174e+06
New York Knicks           4.581494e+06
Detroit Pistons           4.477884e+06
Minnesota Timberwolves    4.467769e+06
Indiana Pacers            4.450122e+06
New Orleans Pelicans      4.355304e+06
Milwaukee Bucks           4.350220e+06
Orlando Magic             4.297248e+06
Phoenix Suns              4.229676e+06
Utah Jazz                 4.204006e+06
Denver Nuggets            4.197400e+06
Boston Celtics            4.092009e+06
Brooklyn Nets             3.501898e+06
Portland Trail Blazers    3.220121e+06
Philadelphia 76ers        2.255464e+06
Name: Salary, dtype: float64

In [14]:
#diff between tallest and shortest player
t = df['CM_Height'].max()
sh = df['CM_Height'].min()
diff = t - sh
print(f"difference between the tallest ({t}) and shortest ({sh}) player is: ({diff}) cm")

difference between the tallest (217.5) and shortest (172.5) player is: (45.0) cm